[
  {
    "id": 1,
    "title": "Desenvolvedor Fullstack Jr",
    "description": "Desenvolvimento e manutenção de CRM no setor de concessionárias.",
    "date": "Mai 2025 - momento",
    "tech": ["PHP","CodeIgniter", "Laravel", "Next.JS", "MySQL", "MongoDB", "Jira", "GitLab", "GIT", "Docker"],
    "position": "start",
    "description_final": "<p>No dia a dia, trabalhei com metodologias ágeis(Kanban e Scrum) ,utilizando Jira para acompanhamento de tarefas no board, garantindo entregas eficientes e alinhamento com o time. Além de participar de daily's e reuniões técnicas.</p><ul class=\"list-disc list-inside space-y-1 mt-4 text-wrap\"><li class=\"text-sm\">Implementação de templates gerenciáveis utilizando <strong> Next.JS e TailwindCSS</strong>.</li><li class=\"text-sm\">Versionamento com GitLab.</li><li class=\"text-sm\">COntainerização do ambiente com Docker</li><li class=\"text-sm\">Manutenção e implementação de features em sistemas legados utilizando <strong>Code Igniter </strong>.</li></ul>"
  },
  {
    "id": 2,
    "title": "Desenvolvedor Web Trainee",
    "description": "Atuei no desenvolvimento e manutenção de um SaaS no mercado livre de energia, implementando novas funcionalidades e corrigindo bugs críticos no backend e frontend.",
    "date": "Set de 2023 - Abril 2025",
    "tech": ["PHP", "jQuery", "EasyUI", "MySQL", "AWS", "Jira", "Python", "Google Cloud", "GIT"],
    "position": "end",
    "description_final": "<p>No dia a dia, trabalhei com metodologias ágeis (Kanban), utilizando Jira para acompanhamento de tarefas, garantindo entregas eficientes e alinhamento com o time. Além disso, auxiliei no onboarding de novos membros, facilitando a adaptação ao projeto.</p><ul class=\"list-disc list-inside space-y-1 mt-4 text-wrap\"><li class=\"text-sm\">Implementação e otimização de filas de processamento de documentos PDF (NF3-e), integrando o backend com APIs da AWS e Google Cloud.</li><li class=\"text-sm\">Automação de faturamento e envio de e-mails, melhorando a eficiência operacional.</li><li class=\"text-sm\">Criação de scripts em Python para desbloqueio de PDFs e leitura de dados.</li><li class=\"text-sm\">Migração de serviços de AWS Textract para Google Cloud Document AI, incorporando Machine Learning ao processo de extração de dados de NF3-e.</li></ul>"
  },
  {
    "id": 3,
    "title": "Estagiário em TI",
    "description": "Estágio no setor de T.I em análise de sistemas e infraestrutura.",
    "date": "Fev de 2023 - Set de 2023",
    "tech": ["Linux", "Zabbix", "Suporte", "MySQL"],
    "position": "start",
    "description_final": "<p>No dia a dia, trabalhei com metodologias ágeis (Kanban), utilizando Jira para acompanhamento de tarefas.Além disso, auxiliei no onboarding de novos membros, facilitando a adaptação ao TI da empresa.</p><ul class=\"list-disc list-inside space-y-1 mt-4 text-wrap\"><li class=\"text-sm\">Instalação de Windows e Linux</li><li class=\"text-sm\">Formatação de sistemas e manutenção de rede,</li><li class=\"text-sm\">Suporte de chamados e manutenção de hardware</li><li class=\"text-sm\">Monitoramento via Zabbix</li><li class=\"text-sm\">Manutenção e desenvolvimento de um sistema web desenvolvido com <strong>HTML,JS, Bootstrap, PHP e MySQL</strong> para fluxo de inventário dos colaboradores.</li></ul>"
  }
]
